package student_daniel.lesson2.level6;

import teacher.annotations.CodeReview;

@CodeReview(approved = true)
class Task_26 {
//    Проверьте все названия созданных вами пакетов.
//
//    В их названии должны использоваться только маленькие буквы!
//    Так принято в языке Java.
//
//    Хотя компилятор и даёт вам возможность в названии пакетов использовать заглавные буквы,
//    это сильно ухудшает читаемость Java кода особенно в больших приложениях,
//    которые вы вскоре будете писать самостоятельно. Поэтому сразу приучаемся
//    называть пакеты правильно!
//
//    Исправьте названия своих пакетов если в них встретятся заглавные буквы.
//
//    Alt (слева) + 1 - открываем окно проекта.
//
//    Стрелками вверх, вниз, вправо, влево выбираем пакет
//    в названии которого есть заглавные буквы.
//
//    Вызывает всплывающее меню используя клавиатуру.
//
//            Refactor -> Rename...
//
//    И даём новое название вашему пакету.
//
//    Быстрая комбинация клавиш, когда курсов находится на имени пакета в редакторе кода: Shift (слева) + F6.
}
